--function oldevent_7()
    if instruct_16(1,0,0) ==true then    --  16(10):队伍是否有[胡斐]否则跳转到:Label0
        if instruct_43(117,0) ==true then    --  43(2B):是否有物品[屠龙刀]否则跳转到:Label0
            if instruct_43(121,0) ==true then    --  43(2B):是否有物品[金丝背心]否则跳转到:Label0
                instruct_32(117,-1);   --  32(20):物品[屠龙刀]+[-1]
                instruct_32(121,-1);   --  32(20):物品[金丝背心]+[-1]
                instruct_2(144,1);   --  2(2):得到物品[飞狐外传][1]
                instruct_37(5);   --  37(25):增加道德5
                instruct_1(292,0,1);   --  1(1):[WWW]说: 苗大侠，这是您要的飞狐外*传，我已为您取回了！
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_1(293,3,0);   --  1(1):[苗人凤]说: 太好了！小兄弟，多谢你为*我做的一切！
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_3(-2,9,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号 [9]
                do return; end
            end
        end
    end
    instruct_1(294,0,1);   --  1(1):[WWW]说: 苗大侠，我还需要准备一些*东西才能帮您取回飞狐外传．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(295,3,0);   --  1(1):[苗人凤]说: 要取回飞狐外传，需要我*的结拜兄弟胡斐相助，*再加上屠龙刀和金丝背心*才能成功．
    instruct_0();   --  0(0)::空语句(清屏)
--end
