--function oldevent_7()
    if instruct_16(1,0,0) ==true then    --  16(10):队伍是否有[胡斐]否则跳转到:Label0
        if instruct_43(117,0) ==true then    --  43(2B):是否有物品[屠龙刀]否则跳转到:Label0
            if instruct_43(121,0) ==true then    --  43(2B):是否有物品[金丝背心]否则跳转到:Label0
                instruct_32(117,-1);   --  32(20):物品[屠龙刀]+[-1]
                instruct_32(121,-1);   --  32(20):物品[金丝背心]+[-1]
                instruct_2(144,1);   --  2(2):得到物品[飞狐外传][1]
                instruct_37(5);   --  37(25):增加道德5
                instruct_1(130,3,0);   --  1(1):[苗人凤]说: 胡斐，你准备好了吗？
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_1(134,3,0);   --  1(1):[苗人凤]说: 走之前，拿了这把冷月宝刀，*这是一把适合你的宝刀．*还有，这本书拿去吧，*希望能帮小兄弟解决困难．
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_3(-2,9,0,0,-1,-1,-1,-1,-1,-1,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号 [9]
                do return; end
            end
        end
    end
    instruct_1(129,3,0);   --  1(1):[苗人凤]说: 其实我心中有个遗憾，当年*我砍到胡兄手臂时，我同时*也被胡兄的後着踢倒在地，*只因我剑上被喂上剧毒，胡*兄才会毒发死亡．所以到底*是何者的功夫高明，一直没*有答案．***今天我知道胡家有後，我很*高兴．但我更希望他能学好*胡家刀法，把我打败，让胡*家刀法发扬光大，那我对他*爹也有个交待．**届时你想要的”飞狐外传”*一书也将送上．**麻烦你转告他，等他准备好*了，可随时来找我．
    instruct_0();   --  0(0)::空语句(清屏)
--end
